fixed_bottleneck/lighter/httperf/test1.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=44.252.104.243 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.07 --send-buffer=4096 --recv-buffer=16384 --wsesslog=500,0.000,input.txt
Maximum connect burst length: 2

Total: connections 500 requests 9277 replies 9085 test-duration 35.875 s

Connection rate: 13.9 conn/s (71.7 ms/conn, <=478 concurrent connections)
Connection time [ms]: min 103.3 avg 9274.2 max 34451.2 median 7368.5 stddev 7089.3
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 349.423

Request rate: 258.6 req/s (3.9 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 62.4 avg 252.9 max 378.8 stddev 121.5 (7 samples)
Reply time [ms]: response 69.8 transfer 0.0
Reply size [B]: header 220.0 content 2155.0 footer 0.0 (total 2375.0)
Reply status: 1xx=0 2xx=9085 3xx=0 4xx=0 5xx=0

CPU time [s]: user 31.05 system 4.82 (user 86.6% system 13.4% total 100.0%)
Net I/O: 614.5 KB/s (5.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 9085 
Session rate [sess/s]: min 0.00 avg 0.72 max 1.20 stddev 0.41 (26/26)
Session: avg 1.00 connections/session
Session lifetime [s]: 9.3
Session failtime [s]: 0.0
Session length histogram: 0 0 0 1 1 0 1 6 5 0 1 0 2 1 0 1 2 0 0 1 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1