fixed_bottleneck/lighter/httperf/test3.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=44.252.104.243 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.07 --send-buffer=4096 --recv-buffer=16384 --wsesslog=500,0.000,input.txt
Maximum connect burst length: 2

Total: connections 500 requests 9595 replies 9405 test-duration 36.618 s

Connection rate: 13.7 conn/s (73.2 ms/conn, <=478 concurrent connections)
Connection time [ms]: min 105.7 avg 10185.1 max 33261.2 median 7480.5 stddev 8261.3
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 348.333

Request rate: 262.0 req/s (3.8 ms/req)
Request size [B]: 106.0

Reply rate [replies/s]: min 62.4 avg 255.5 max 382.4 stddev 124.1 (7 samples)
Reply time [ms]: response 74.5 transfer 0.0
Reply size [B]: header 219.0 content 2152.0 footer 0.0 (total 2371.0)
Reply status: 1xx=0 2xx=9405 3xx=0 4xx=0 5xx=0

CPU time [s]: user 31.54 system 5.08 (user 86.1% system 13.9% total 100.0%)
Net I/O: 622.2 KB/s (5.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 9405 
Session rate [sess/s]: min 0.00 avg 0.74 max 1.40 stddev 0.46 (27/27)
Session: avg 1.00 connections/session
Session lifetime [s]: 10.2
Session failtime [s]: 0.0
Session length histogram: 0 0 0 1 1 0 1 6 5 0 1 0 2 1 0 1 2 0 0 1 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2